---
kind: type
id: T:Autodesk.Revit.DB.ReferencePointArray
source: html/4780adea-9e68-b0b4-09c7-68f7752dd650.htm
---
# Autodesk.Revit.DB.ReferencePointArray

An array that contains reference objects.

## Syntax (C#)
```csharp
public class ReferencePointArray : APIObject,
	IEnumerable
```